# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'lazydocker'
brew 'zsh'
brew 'zsh-completions'

# Development
brew 'node'
brew 'yarn'

# Apps
cask 'arq'
cask '1password'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'github'
cask 'google-chrome'
cask 'notion'
cask 'iterm2'
cask 'skype'
cask 'postico'
cask 'paw'
cask 'slack'
cask 'sublime-text'
cask 'telegram-desktop'
cask 'visual-studio-code'


# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'


# Mac App Store
# mas 'Byword', id: 420212497
# mas 'Giphy Capture', id: 668208984
# mas 'Keynote', id: 409183694
# mas 'Numbers', id: 409203825
# mas 'Spark', id: 1176895641
# mas 'Speedtest', id: 1153157709
# mas 'Things', id: 904280696
# mas 'Tweetbot', id: 1384080005
